renesas/fsp/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA2L209.h
typedef struct                         /*!< (@ 0x40097000) R_UARTA0 Structure                                         */
{
    __IOM uint8_t TXBAn;               /*!< (@ 0x00000000) Transmit Buffer Register 0                                 */
    __IM uint8_t  RXBAn;               /*!< (@ 0x00000001) Receive Buffer Register 0                                  */

    union
    {
        __IOM uint8_t ASIMAn0;         /*!< (@ 0x00000002) Operation Mode Setting Register 00                         */

        struct
        {
            __IOM uint8_t ISRMA : 1;   /*!< [0..0] Receive Interrupt Mode Select                                      */
            __IOM uint8_t ISSMA : 1;   /*!< [1..1] Transmit Interrupt Mode Select                                     */
            uint8_t             : 3;
            __IOM uint8_t RXEA  : 1;   /*!< [5..5] Reception Enable                                                   */
            __IOM uint8_t TXEA  : 1;   /*!< [6..6] Transmission Enable                                                */
            __IOM uint8_t EN    : 1;   /*!< [7..7] UART Operation Enable                                              */
        } ASIMAn0_b;
    };

    union
    {
        __IOM uint8_t ASIMAn1;         /*!< (@ 0x00000003) Operation Mode Setting Register 01                         */

        struct
        {
            __IOM uint8_t ALV : 1;     /*!< [0..0] Transmission and Reception Level Setting                           */
            __IOM uint8_t DIR : 1;     /*!< [1..1] Transmission and Reception Order Setting                           */
            __IOM uint8_t SL  : 1;     /*!< [2..2] Transmission Stop Bit Length Setting                               */
            __IOM uint8_t CL  : 2;     /*!< [4..3] Transmission and Reception Character Length Setting                */
            __IOM uint8_t PS  : 2;     /*!< [6..5] Transmission and Reception Parity Bit Setting                      */
            uint8_t           : 1;
        } ASIMAn1_b;
    };
    __IOM uint8_t BRGCAn;              /*!< (@ 0x00000004) Baud Rate Generator Control Register 0                     */

    union
    {
        __IM uint8_t ASISAn;           /*!< (@ 0x00000005) Status Register 0                                          */

        struct
        {
            __IM uint8_t OVEA  : 1;    /*!< [0..0] Overrun Error Flag                                                 */
            __IM uint8_t FEA   : 1;    /*!< [1..1] Framing Error Flag                                                 */
            __IM uint8_t PEA   : 1;    /*!< [2..2] Parity Error Flag                                                  */
            uint8_t            : 1;
            __IM uint8_t TXSFA : 1;    /*!< [4..4] Transmit Shift Register Data Flag                                  */
            __IM uint8_t TXBFA : 1;    /*!< [5..5] Transmit Buffer Data Flag                                          */
            uint8_t            : 2;
        } ASISAn_b;
    };

    union
    {
        __IOM uint8_t ASCTAn;          /*!< (@ 0x00000006) Status Clear Trigger Register 0                            */

        struct
        {
            __IOM uint8_t OVECTA : 1;  /*!< [0..0] Overrun Error Flag Clear Trigger                                   */
            __IOM uint8_t FECTA  : 1;  /*!< [1..1] Framing Error Flag Clear Trigger                                   */
            __IOM uint8_t PECTA  : 1;  /*!< [2..2] Parity Error Flag Clear Trigger                                    */
            uint8_t              : 5;
        } ASCTAn_b;
    };
} R_UARTA0_Type;                       /*!< Size = 7 (0x7)                                                            */

/* =========================================================================================================================== */
/* ================                                        R_UARTA_CK                                         ================ */
/* =========================================================================================================================== */

/**
 * @brief Serial Interface UARTA Clock (R_UARTA_CK)
 */

typedef struct                         /*!< (@ 0x40097010) R_UARTA_CK Structure                                       */
{
    union
    {
        __IOM uint8_t UTAnCK[2];       /*!< (@ 0x00000000) UARTA Clock Select Register                                */

        struct
        {
            __IOM uint8_t CK  : 4;     /*!< [3..0] UARTAn Operation Clock Select (fUTAn)                              */
            __IOM uint8_t SEL : 2;     /*!< [5..4] fSEL Clock Select                                                  */
            uint8_t           : 1;
            __IOM uint8_t EN  : 1;     /*!< [7..7] UARTAn clock output function enable                                */
        } UTAnCK_b[2];
    };
} R_UARTA_CK_Type;                     /*!< Size = 2 (0x2)                                                            */

/* =========================================================================================================================== */
/* ================                                           R_WDT                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Watchdog Timer (R_WDT)
 */

typedef struct                         /*!< (@ 0x40044200) R_WDT Structure                                            */
{
    union
    {
        __IOM uint8_t WDTRR;           /*!< (@ 0x00000000) WDT Refresh Register                                       */

        struct
        {
            __IOM uint8_t WDTRR : 8;   /*!< [7..0] WDTRR is an 8-bit register that refreshes the down-counter
                                        *   of the WDT.                                                               */
        } WDTRR_b;
    };
    __IM uint8_t RESERVED;

    union
    {
        __IOM uint16_t WDTCR;          /*!< (@ 0x00000002) WDT Control Register                                       */

        struct
        {
            __IOM uint16_t TOPS : 2;   /*!< [1..0] Timeout Period Selection                                           */
            uint16_t            : 2;
            __IOM uint16_t CKS  : 4;   /*!< [7..4] Clock Division Ratio Selection                                     */
            __IOM uint16_t RPES : 2;   /*!< [9..8] Window End Position Selection                                      */
            uint16_t            : 2;
            __IOM uint16_t RPSS : 2;   /*!< [13..12] Window Start Position Selection                                  */
            uint16_t            : 2;
        } WDTCR_b;
    };

    union
    {
        __IOM uint16_t WDTSR;           /*!< (@ 0x00000004) WDT Status Register                                        */

        struct
        {
            __IM uint16_t  CNTVAL : 14; /*!< [13..0] Down-Counter Value                                                */
            __IOM uint16_t UNDFF  : 1;  /*!< [14..14] Underflow Flag                                                   */
            __IOM uint16_t REFEF  : 1;  /*!< [15..15] Refresh Error Flag                                               */
        } WDTSR_b;
    };

    union
    {
        __IOM uint8_t WDTRCR;          /*!< (@ 0x00000006) WDT Reset Control Register                                 */

        struct
        {
            uint8_t               : 7;
            __IOM uint8_t RSTIRQS : 1; /*!< [7..7] Reset Interrupt Request Selection                                  */
        } WDTRCR_b;
    };
    __IM uint8_t RESERVED1;

    union
    {
        __IOM uint8_t WDTCSTPR;        /*!< (@ 0x00000008) WDT Count Stop Control Register                            */

        struct
        {
            uint8_t              : 7;
            __IOM uint8_t SLCSTP : 1;  /*!< [7..7] Sleep-Mode Count Stop Control                                      */
        } WDTCSTPR_b;
    };
    __IM uint8_t  RESERVED2;
    __IM uint16_t RESERVED3;
} R_WDT_Type;                          /*!< Size = 12 (0xc)                                                           */

/* =========================================================================================================================== */
/* ================                                          R_AGTX0                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief Asynchronous General Purpose Timer (R_AGTX0)
 */

typedef struct                          /*!< (@ 0x40084000) R_AGTX0 Structure                                          */
{
    union
    {
        __IOM R_AGTX0_AGT32_Type AGT32; /*!< (@ 0x00000000) AGTW (32-bit) peripheral registers                         */
        __IOM R_AGTX0_AGT16_Type AGT16; /*!< (@ 0x00000000) AGT (16-bit) peripheral registers                          */
    };
} R_AGTX0_Type;                         /*!< Size = 20 (0x14)                                                          */

